# Занятие 28. Генераторы списков и словарей
# - Генераторы списков
# - Генераторы словарей
# (for comprehension)

# список
list1 = list(range(1, 21))
print(list1)
# >>[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

#возвести квадрат от каждого числа
list2 = []
for elem in list1:
    list2.append(elem * elem)
print(list2)
# >>[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400]

# Генератор Списка (for comprehension)- это сокращенная запись синтаксиса
# elem -(первое ) это логика для решения
# for elem in list1 - скопировали из list2
# 1 вариант
list3 = [elem for elem in list1]
print(list3)
# >>[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
# 2 вариант
list3 = [1 for elem in list1]
print(list3)
# >>[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
# 3 вариант
list3 = [elem*elem for elem in list1]
print(list3)
# 3 вариант можно сократить до 1 строки, результат тот же
print([elem*elem for elem in list1])
# >>[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400]

# Вызов функций
def plus_2(elem):
    return elem + 2
print([plus_2(elem) for elem in list1])
# >>[3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]

# Лямба функции
print(list(map(lambda elem: plus_2(elem), list1)))
# >>[3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]

print(list(map(lambda el: el, list1)))
# >>[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

print([plus_2(elem) for elem in list1 if elem < 10])
# >>[3, 4, 5, 6, 7, 8, 9, 10, 11]
# _______________________________________________
print('-' * 50)
#Генератор словарей /ключ-значение
# elem : -->(первое) ключ
# elem * elem --> значение
dict1 = {elem: elem * elem for elem in list1}
print(dict1)
# >>{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225, 16: 256, 17: 289, 18: 324, 19: 361, 20: 400}

data = [
    'Молоко',
    'мама',
    'Кефир'
]
print(data)
# >>['Молоко', 'мама', 'Кефир']

# слова + кол-во букв в слове
dict2 = {}
for el in data:
    dict2[el] = len(el)
print(dict2)
# >>{'Молоко': 6, 'мама': 4, 'Кефир': 5}
# сокращенное
print({word: len(word) for word in data})
# >>{'Молоко': 6, 'мама': 4, 'Кефир': 5}
#Дополнительная фильтрация после in
print({word: len(word) for word in data if len(word) > 4})
# >>{'Молоко': 6, 'Кефир': 5}
# ________________________

print(120 * '-')
data2 = {word: len(word) for word in data}
print(data2)
# >>{'Молоко': 6, 'мама': 4, 'Кефир': 5}

# для items нужно применять 2 переменные --> word, word_len
print({word.upper(): word_len for word, word_len in data2.items()})
# >>{'МОЛОКО': 6, 'МАМА': 4, 'КЕФИР': 5}

print({word.lower(): 1 for word in data2.keys()})
# >>{'молоко': 1, 'мама': 1, 'кефир': 1}


